hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v2/TAL_PV_TAM/TAM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v2"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>PV</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <TAM>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>${meldungsCode}</meldungscode>
                            <meldungstext>${meldungsText}</meldungstext>
                        </position>
                    </meldungspositionen>
                </TAM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
